SUITS = ("Червы", "Бубны", "Пики", "Трефы")

RANKS = (
    "Двойка",
    "Тройка",
    "Четвёрка",
    "Пятерка",
    "Шестёрка",
    "Семёрка",
    "Восьмёрка",
    "Девятка",
    "Десятка",
    "Валет",
    "Дама",
    "Король",
    "Туз",
)

VALUES = {
    "Двойка": 2,
    "Тройка": 3,
    "Четвёрка": 4,
    "Пятерка": 5,
    "Шестёрка": 6,
    "Семёрка": 7,
    "Восьмёрка": 8,
    "Девятка": 9,
    "Десятка": 10,
    "Валет": 10,
    "Дама": 10,
    "Король": 10,
    "Туз": 11,
}

DISPLAY_RANKS = {
    "Двойка": "2",
    "Тройка": "3",
    "Четвёрка": "4",
    "Пятерка": "5",
    "Шестёрка": "6",
    "Семёрка": "7",
    "Восьмёрка": "8",
    "Девятка": "9",
    "Десятка": "10",
    "Валет": "J",
    "Дама": "Q",
    "Король": "K",
    "Туз": "A",
}
DISPLAY_SUITS = {
    "Червы": "❤️",
    "Бубны": "♦️",
    "Пики": "♠️",
    "Трефы": "♣️",
}

TARGET = 21

DEALER_MIN_TARGET = 17

YES = "y"
NO = "n"

VALID_ANSWERS = (YES, NO)
